{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "axis": -1, "input_dtype": "float32", "momentum": 0.99, "batch_input_shape": [null, 64, 64, 3], "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "name": "batchnormalization_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 24, "activation": "relu", "nb_row": 5, "activity_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_1", "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 36, "activation": "relu", "nb_row": 5, "activity_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_2", "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 48, "activation": "relu", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_3", "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "activation": "relu", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_4", "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "activation": "relu", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_5", "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "input_dim": 4096, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1164, "bias": true, "name": "dense_1", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "input_dim": 1164, "activity_regularizer": null, "b_regularizer": null, "output_dim": 100, "bias": true, "name": "dense_2", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "input_dim": 100, "activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "bias": true, "name": "dense_3", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "input_dim": 50, "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "bias": true, "name": "dense_4", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 10, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "bias": true, "name": "dense_5", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "W_regularizer": null}}]}